app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def home
    @posts = Post.all

SELECT "posts".* FROM "posts" ORDER BY updated_at ASC
---
 	def index
    @posts = Post.all.order("updated_at ASC")

INSERT INTO "posts" ("date", "title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @post = Post.new(post_params)
    if @post.save

UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3
---
  def update
  	find_post
    if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
  def destroy
  	find_post
    @post.destroy